ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32Arduino_WordClockV025/ESP32Arduino_WordClockV025.ino
/* 

--------------------------------------  
 Author .    : Ed Nieuwenhuys
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V002: 
 Changes V003: Clock and SK6812 LEDstrip working
 Changes V004: Changed the coding pin numbering to Arduino default macro numbering D0, D1, A4 et cetera
 Changes V005: Language #define settings are working. Code cleanup
 Changes V006: Replaced AsyncElegantOTA with newer ElegantOTA
 Changes V007: WPS functionality added (not working yet (see line 2339)
               void SetStatusLED from int to bool. Removed Colors.h
 Changes V008: Code clean up. Minute and second colour of HET IS WAS repaired in NL144CLOCK. Defines of NL144CLOCK reordered
 Changes V009: Rewritten IS WAS changing every second in single language clock
               Corrected SetRTCtime() struct timeval now = { .tv_sec = t , .tv_usec = t}; --> struct timeval now = { .tv_sec = t , .tv_usec = 0};
 Changes V010: Stable version. Added four LEDs to strip for minute 1, 2, 3 and 4
 Changes V011: Added Login page (Not working yet) A page is visible but input is neglected
 Changes V012: Mislukt
 Changes V013: WIFI manager nog verbeteren of verwijderen
 Changes V014: WIFI manager verwijderd.Webpage updated
 Changes V015: ---
 Changes V016: Added RTC <-- stopped. some changed added to V017
 Changes V017: Added DS3231 source. Added again the defines for NL144 word clock Source Derived from Klok Ulirich Vertessen ESP32Arduino_WordClockV014U002.ino
 Changes V018: Added DS3231 code from Character_Colour_Clock_V089.ino. DS3231 Get proper time
 Changes V019: Added DS3231 functionality. ie that the clock get its time from the Ds3231 Module if no NTP or WIFI
 Changes V020: Removed CR LF from the Inputstring
 Changes V021: Clean up code
 Changes V022: Ulrich Vertessen clock. % in menu switches between SK6812 and WS2812 LEDstrip. Selftest added  with # in menu
 Changes V023: Updated HTML page. Reference to manual on Github
 Changes V024: Changed ESP32 board to 3.0.0. Arduino Nano ESP32 still version 2.0.
               
  Changed ESP32 board to 3.0.0
               Changed in Arduino\libraries\ESPAsyncWebServer\src\WebAuthentic
               at line 75,76,77   
               //-----------------              
                #ifdef ESP_ARDUINO_VERSION_MAJOR
                   #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
                     // Code for version 3.x
                   mbedtls_md5_init(&_ctx);
                   mbedtls_md5_starts(&_ctx);
                   mbedtls_md5_update(&_ctx, data, len);
                   mbedtls_md5_finish(&_ctx, _buf);
                   #else
                    // Code for version 2.x
                   #ifdef ESP32
                      mbedtls_md5_init(&_ctx);
                      mbedtls_md5_starts_ret(&_ctx);
                      mbedtls_md5_update_ret(&_ctx, data, len);
                      mbedtls_md5_finish_ret(&_ctx, _buf);
                   #else
                      MD5Init(&_ctx);
                      MD5Update(&_ctx, data, len);
                      MD5Final(_buf, &_ctx);
                    #endif
                 #endif
                #endif
               //-------------------- 
               in AsyncEventSource.cpp changed at line 189 ets_printf --> log_e for V3
               in AsyncWebSocket.cpp changed at line 549 ets_printf --> log_e  for V3
                 #ifdef ESP_ARDUINO_VERSION_MAJOR
                   #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
                     // Code for version 3.x
                    log_e("ERROR: Too many messages queued\n");
                   #else
                    // Code for version 2.x
                    ets_printf("ERROR: Too many messages queued\n");
                 #endif
                #endif  
                


How to compile: 
Install Arduino Nano ESP32 boards
Board: Arduino Nano ESP32
Partition Scheme: With FAT
Pin Numbering: By GPIO number (legacy)
Select below the clock type

*/
// =============================================================================================================================

// ------------------>   Define only one clock type
//#define FOURLANGUAGECLOCK
//#define NL144CLOCK
#define ULRICH

//--------------------------------------------
// ESP32 Includes defines and initialisations
//--------------------------------------------

#include <Preferences.h>
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel   for LED strip WS2812 or SK6812
#include <NimBLEDevice.h>      // For BLE communication  https://github.com/h2zero/NimBLE-Arduino
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include "esp_wps.h"           // WPS functionality
#include <AsyncTCP.h>          // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <ElegantOTA.h>        // If compile error see here :https://docs.elegantota.pro/async-mode/  Used for OTA new version // #include <AsyncElegantOTA.h>   // Used for OTA old version
 //                    #ifdef  MOD_DS3231
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
 //                    #endif  //MOD_DS3231

//------------------------------------------------------------------------------
// ARDUINO Definition of installed language word clock
//------------------------------------------------------------------------------
                     #ifdef FOURLANGUAGECLOCK
#define NL
#define UK
#define DE
#define FR    
                     #endif //FOURLANGUAGECLOCK  

#define MIN1   ColorLeds("M1",    140, 140, LetterColor); 
#define MIN2   ColorLeds("M2",    141, 141, LetterColor);       //MINColor); 
#define MIN3   ColorLeds("M3",    142, 142, LetterColor);
#define MIN4   ColorLeds("M4",    143, 143, LetterColor);                                           
                                      

                     #ifdef NL144CLOCK
#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);  ColorLeds("", 8,10, 0); Is = true;
#define WAS     ColorLeds("was",     8,  10, SECColor);  ColorLeds("", 4, 5, 0); Is = false;
#define PRECIES ColorLeds("precies", 17, 23, LetterColor);
#define MTIEN   ColorLeds("tien",    12, 15, LetterColor); 
#define MVIJF   ColorLeds("vijf",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   30, 34, LetterColor);
#define VOOR    ColorLeds("voor",    44, 47, LetterColor);
#define OVER    ColorLeds("over",    38, 41, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    66, 69, LetterColor);
#define TWEE    ColorLeds("twee",    60, 63, LetterColor);
#define EEN     ColorLeds("een",     72, 74, LetterColor);
#define VIER    ColorLeds("vier",    77, 80, LetterColor);
#define TIEN    ColorLeds("tien",    91, 94, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84, 89, LetterColor);
#define DRIE    ColorLeds("drie",    96, 99, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   114,117, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    110,112, LetterColor);
#define ZEVEN   ColorLeds("zeven",  121,125, LetterColor);
#define ELF     ColorLeds("elf",    128,130, LetterColor);
#define NOEN    ColorLeds("noen",   139,142, LetterColor);
#define UUR     ColorLeds("uur",    134,136, LetterColor);
#define EDSOFT  ColorLeds("EdSoft", 132,132, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
                     #endif //NL144CLOCK
                     
                     
