ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32Arduino_WordClockV025/ESP32Arduino_WordClockV025.ino
switch (sayhour)
 {
  case 13:  
  case 1: EEN; break;
  case 14:
  case 2: TWEE; break;
  case 15:
  case 3: DRIE; break;
  case 16:
  case 4: VIER; break;
  case 17:
  case 5: VIJF; break;
  case 18:
  case 6: ZES; break;
  case 19:
  case 7: ZEVEN; break;
  case 20:
  case 8: ACHT; break;
  case 21:
  case 9: NEGEN; break;
  case 22:
  case 10: TIEN; break;
  case 23:
  case 11: ELF; break;
  case 0:
  case 12: TWAALF; break;
 } 
 switch (timeinfo.tm_min)
 {
  case 59: 
  case  0: 
  case  1: 
  case  2: 
  case  3: UUR;  break; 
 }

 switch (timeinfo.tm_min % 5)                                                                // The minutes modulo 5
 {
  case  0: break;
  case  1: MIN1; break;
  case  2: MIN1; MIN2; break;
  case  3: MIN1; MIN2; MIN3; break;
  case  4: MIN1; MIN2; MIN3; MIN4;  
 }
}
                                    #endif //NL144CLOCK
                                    #ifdef ULRICH
void Dutch(void)
{
HET;                                                                                          // HET  is always on
switch (timeinfo.tm_min)
 {
  case  0: IS;  break;
  case  1: IS;  break; 
  case  2: IS;  break; 
  case  3: IS;  break; 
  case  4: IS;  break; 
  case  5: IS;  MVIJF; OVER; break;
  case  6: IS;  MVIJF; OVER; break;
  case  7: IS;  MVIJF; OVER; break;
  case  8: IS;  MVIJF; OVER; break;
  case  9: IS;  MVIJF; OVER; break;
  case 10: IS;  MTIEN; OVER; break;
  case 11: IS;  MTIEN; OVER; break;
  case 12: IS;  MTIEN; OVER; break;
  case 13: IS;  MTIEN; OVER; break;
  case 14: IS;  MTIEN; OVER; break;
  case 15: IS;  KWART; OVER2; break;
  case 16: IS;  KWART; OVER2; break;
  case 17: IS;  KWART; OVER2; break;
  case 18: IS;  KWART; OVER2; break;
  case 19: IS;  KWART; OVER2; break;
  case 20: IS;  MTIEN; MVOOR; HALF; break;
  case 21: IS;  MTIEN; MVOOR; HALF; break;
  case 22: IS;  MTIEN; MVOOR; HALF; break;
  case 23: IS;  MTIEN; MVOOR; HALF; break;
  case 24: IS;  MTIEN; MVOOR; HALF; break;
  case 25: IS;  MVIJF; MVOOR; HALF; break;
  case 26: IS;  MVIJF; MVOOR; HALF; break;
  case 27: IS;  MVIJF; MVOOR; HALF; break;
  case 28: IS;  MVIJF; MVOOR; HALF; break;
  case 29: IS;  MVIJF; MVOOR; HALF; break;
  case 30: IS;  HALF; break;
  case 31: IS;  HALF; break;
  case 32: IS;  HALF; break;
  case 33: IS;  HALF; break;
  case 34: IS;  HALF; break;
  case 35: IS;  MVIJF; OVER; HALF; break;
  case 36: IS;  MVIJF; OVER; HALF; break;
  case 37: IS;  MVIJF; OVER; HALF; break;
  case 38: IS;  MVIJF; OVER; HALF; break;
  case 39: IS;  MVIJF; OVER; HALF; break;
  case 40: IS;  MTIEN; OVER; HALF; break;
  case 41: IS;  MTIEN; OVER; HALF; break;
  case 42: IS;  MTIEN; OVER; HALF; break;
  case 43: IS;  MTIEN; OVER; HALF; break;
  case 44: IS;  MTIEN; OVER; HALF; break;
  case 45: IS;  KWART; VOOR; break;
  case 46: IS;  KWART; VOOR; break;
  case 47: IS;  KWART; VOOR; break;
  case 48: IS;  KWART; VOOR; break;
  case 49: IS;  KWART; VOOR; break;
  case 50: IS;  MTIEN; VOOR;  break;
  case 51: IS;  MTIEN; VOOR;  break;
  case 52: IS;  MTIEN; VOOR;  break;
  case 53: IS;  MTIEN; VOOR;  break;
  case 54: IS;  MTIEN; VOOR;  break;
  case 55: IS;  MVIJF; VOOR; break;
  case 56: IS;  MVIJF; VOOR; break;
  case 57: IS;  MVIJF; VOOR; break;
  case 58: IS;  MVIJF; VOOR; break;
  case 59: IS;  MVIJF; VOOR; break;
}
//if (timeinfo.tm_hour >=0 && hour <12) digitalWrite(AMPMpin,0); else digitalWrite(AMPMpin,1);

 sayhour = timeinfo.tm_hour;
 if (timeinfo.tm_min > 18 )  sayhour = timeinfo.tm_hour+1;
 if (sayhour == 24) sayhour = 0;

switch (sayhour)
 {
  case 13:  
  case 1: EEN; break;
  case 14:
  case 2: TWEE; break;
  case 15:
  case 3: DRIE; break;
  case 16:
  case 4: VIER; break;
  case 17:
  case 5: VIJF; break;
  case 18:
  case 6: ZES; break;
  case 19:
  case 7: ZEVEN; break;
  case 20:
  case 8: ACHT; break;
  case 21:
  case 9: NEGEN; break;
  case 22:
  case 10: TIEN; break;
  case 23:
  case 11: ELF; break;
  case 0:
  case 12: TWAALF; break;
 } 
 switch (timeinfo.tm_min)
 {
//  case 59: 
  case  0: 
  case  1: 
  case  2: 
  case  3: 
  case  4: UUR;  break; 
 }

 switch (timeinfo.tm_min % 5)                                                                // The minutes modulo 5
 {
  case  0: break;
  case  1: MIN1; break;
  case  2: MIN1; MIN2; break;
  case  3: MIN1; MIN2; MIN3; break;
  case  4: MIN1; MIN2; MIN3; MIN4;  
 }
}
                     #endif  //ULRICH

                     #ifdef UK
//--------------------------------------------                                                //
//  CLOCK English clock display
//--------------------------------------------
void English(void)
{
 IT;                                                                                          // IT is always on
// if (timeinfo.tm_hour == 00 && timeinfo.tm_min == 0 && random(2)==0) { ISUK; MID; NIGHT; return; } 
 switch (timeinfo.tm_min)
 {
  case  0: ISUK;  EXACTUK; break;
  case  1: ISUK;  break;
  case  2: 
  case  3: WASUK; break;
  case  4: 
  case  5: 
  case  6: ISUK;  MFIVE; PAST; break;
  case  7: 
  case  8: WASUK; MFIVE; PAST; break;
  case  9: 
  case 10: 
  case 11: ISUK;  MTEN; PAST; break;
  case 12: 
  case 13: WASUK; MTEN; PAST; break;
  case 14: 
  case 15: 
  case 16: ISUK;  QUARTER; PAST; break;
  case 17: 
  case 18: WASUK; QUARTER; PAST; break;
  case 19: 
  case 20: 
  case 21: ISUK;  TWENTY; PAST; break;
  case 22: 
  case 23: WASUK; TWENTY; PAST; break;
  case 24: 
  case 25: 
  case 26: ISUK;  TWENTY; MFIVE; PAST; break;
  case 27: 
  case 28: WASUK; TWENTY; MFIVE; PAST; break;
  case 29: ISUK;  HALFUK; PAST; break;
  case 30: ISUK;  EXACTUK; HALFUK; PAST; break;
  case 31: ISUK;  HALFUK; PAST; break;
  case 32: 
  case 33: WASUK; HALFUK; PAST; break;
  case 34: 
  case 35: 
  case 36: ISUK;  TWENTY; MFIVE; TO; break;
  case 37: 
  case 38: WASUK; TWENTY; MFIVE; TO; break;
  case 39: 
  case 40: 
  case 41: ISUK;  TWENTY; TO; break;
  case 42: 
  case 43: WASUK; TWENTY; TO break;
  case 44: 
  case 45: 
  case 46: ISUK;  QUARTER; TO; break;
  case 47: 
  case 48: WASUK; QUARTER; TO; break;
  case 49: 
  case 50: 
  case 51: ISUK;  MTEN; TO;  break;
  case 52: 
  case 53: WASUK; MTEN; TO;  break;
  case 54: 
  case 55: 
  case 56: ISUK;  MFIVE; TO; break;
  case 57: 
  case 58: WASUK; MFIVE; TO; break;
  case 59: ISUK;  break;
}
//if (timeinfo.tm_hour >=0 && hour <12) digitalWrite(AMPMpin,0); else digitalWrite(AMPMpin,1);

 sayhour = timeinfo.tm_hour;
 if (timeinfo.tm_min > 33 ) sayhour = timeinfo.tm_hour+1;
 if (sayhour == 24) sayhour = 0;

